bj/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 67978;

boundaryField
{
    my-velocity-inlet
    {
        type            zeroGradient;
    }

    my-pressure-outlet
    {
        type            fixedValue;
	value		uniform 67978;
    }
     
    freeSurf
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            zeroGradient;
    }

    "(frontPlanes|backPlanes)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
